Дошкольное_учреждение83/src/Catalogs/удуСерии/удуСерии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>удуСерии</name>
  <attributes>
    <name>ТипПериодическогоИздания</name>
    <type>
      <types>EnumRef.удуТипыПериодическихИзданий</types>
    </type>
  </attributes>
  <attributes>
    <name>Учредитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Иллюстрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПервого</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СведенияОтносящиесяКЗаглавию</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщееОбозначениеМатериала</name>
    <type>
      <types>EnumRef.удуОбозначенияМетодическихМатериалов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Издательства</name>
    <attributes>
      <name>Издательство</name>
      <type>
        <types>CatalogRef.удуИздательства</types>
      </type>
    </attributes>
    <attributes>
      <name>СтандартныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МестоИздания</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСтандартногоНомера</name>
      <type>
        <types>EnumRef.удуВидыСтандартныхНомеров</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Дошкольное_учреждение83/src/Enums/удуОбозначенияМетодическихМатериалов/удуОбозначенияМетодическихМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>удуОбозначенияМетодическихМатериалов</name>
  <enumValues>
    <name>Видеозапись</name>
  </enumValues>
  <enumValues>
    <name>Звукозапись</name>
  </enumValues>
  <enumValues>
    <name>Изоматериал</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Комплект</name>
  </enumValues>
  <enumValues>
    <name>Кинофильм</name>
  </enumValues>
  <enumValues>
    <name>Микроформа</name>
  </enumValues>
  <enumValues>
    <name>Мультимедиа</name>
  </enumValues>
  <enumValues>
    <name>Ноты</name>
  </enumValues>
  <enumValues>
    <name>Предмет</name>
  </enumValues>
  <enumValues>
    <name>Рукопись</name>
  </enumValues>
  <enumValues>
    <name>Текст</name>
  </enumValues>
  <enumValues>
    <name>ШрифтБрайля</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныйРесурс</name>
  </enumValues>
</mdclass:Enum>

Дошкольное_учреждение83/src/Catalogs/удуСерии/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ОбновитьБиблиографическоеПредставлениеСерия()
	Объект.Представление = удуУчетМетодическихМатериалов.СформироватьПредставлениеПериодикаВершина(ЭтаФорма);
КонецПроцедуры // ОбновитьБиблиографическоеПредставлениеСерия()

&НаКлиенте
Процедура ОбновитьПредставление(Команда)
	ОбновитьБиблиографическоеПредставлениеСерия();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ОбновитьБиблиографическоеПредставлениеСерия();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УчетныеЕдиницы.Параметры.УстановитьЗначениеПараметра("Серия",Объект.Ссылка);
	УчетныеЕдиницы.Параметры.УстановитьЗначениеПараметра("ПустаяСсылка",Справочники.удуСерии.ПустаяСсылка());
	Если Не ЗначениеЗаполнено(Объект.ОбщееОбозначениеМатериала) Тогда
		Объект.ОбщееОбозначениеМатериала = Перечисления.удуОбозначенияМетодическихМатериалов.Текст;
	КонецЕсли;

КонецПроцедуры
